In [20]:
import numpy as np

In [23]:
import pandas as pd

In [13]:
x = np.arange(12).reshape((3,4))

In [4]:
x

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [14]:
x.sum(axis=1)

array([ 6, 22, 38])

In [31]:
y = pd.DataFrame(np.arange(12).reshape(3,4))

In [32]:
y

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [33]:
y.sum(axis=1)

0     6
1    22
2    38
dtype: int64

In [34]:
y.drop([3], axis=1)

   0  1   2
0  0  1   2
1  4  5   6
2  8  9  10

In [39]:
y.drop([2])

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [18]:
data ={'state':['Ohio','Michigan'],
       'year':[2000,2001]}

In [29]:
df1 = pd.DataFrame(data)

In [30]:
df1

      state  year
0      Ohio  2000
1  Michigan  2001

In [24]:
d = {'col1': [1, 2], 'col2': [3, 4]}

In [25]:
df = pd.DataFrame(data=d)

In [26]:
df

   col1  col2
0     1     3
1     2     4